#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_s3_bucket.static_site,
  on main.tf line 1, in resource "aws_s3_bucket" "static_site":
   1: resource "aws_s3_bucket" "static_site" {

Use the aws_s3_bucket_website_configuration resource instead

(and one more similar warning elsewhere)

Warning: Deprecated Resource

  with aws_s3_bucket_object.web_files,
  on main.tf line 12, in resource "aws_s3_bucket_object" "web_files":
  12: resource "aws_s3_bucket_object" "web_files" {

use the aws_s3_object resource instead

Warning: Deprecated attribute

  on outputs.tf line 2, in output "website_url":
   2:   value = aws_s3_bucket.static_site.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.static_site will be created
  + resource "aws_s3_bucket" "static_site" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "bucket-deploys3-angular-vapc-1098824"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + website_url = (known after apply)

Warning: Argument is deprecated

  with aws_s3_bucket.static_site,
  on main.tf line 1, in resource "aws_s3_bucket" "static_site":
   1: resource "aws_s3_bucket" "static_site" {

Use the aws_s3_bucket_website_configuration resource instead

(and 3 more similar warnings elsewhere)

Warning: Deprecated Resource

  with aws_s3_bucket_object.web_files,
  on main.tf line 12, in resource "aws_s3_bucket_object" "web_files":
  12: resource "aws_s3_bucket_object" "web_files" {

use the aws_s3_object resource instead

Warning: Deprecated attribute

  on outputs.tf line 2, in output "website_url":
   2:   value = aws_s3_bucket.static_site.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vperezcerv, Action: `pull_request`*